<template>
  <div class="about_us">
    <h1>
      whatisit创建于2020年，whatisit从创立之初就坚持“网络资源共享”的精神。
    </h1>
    <h2>
      “分享，学习，进步”是whatisit的宗旨，在分享中学习，在学习中进步是我们的目的！
    </h2>
    <h3>没事别乱看人家接口</h3>
    <h2>免责声明：</h2>
    <h3>
      whatisit提醒您：在浏览前，请您务必仔细阅读并透彻理解本声明。您可以选择不浏览本网站，但如果您浏览资源，您的行为将被视为对本声明全部内容的认可。
      我们不提供任何视听上传服务，所有内容均来自视频分享站点所提供的公开引用，所有视频及图文版权均归原作者及其网站所有。本站将竭尽所能注明来源，但由于互联网转载的不可预性，无法确认所有内容的版权所有人。若原作者对本站所载视频作品版权的归属存有异议，请联系我们xkloveme@gmail.com，我们将在第一时间予以处理。
      任何存在于我们上的视频、图文资料均从网络收集所得，不代表我们网站立场。您可能从这些视频、图文资料上获得资讯，我们对其合法性概不负责，亦不承担任何法律责任。
      您应该对浏览使用我们一切服务自行承担风险。我们不做任何形式的保证：不保证站内搜索结果满足您的要求，不保证网站服务不中断，不保证视频及图文我们的安全性、正确性、及时性、合法性。因网络状况、通讯线路、第三方网站等任何原因而导致您不能正常使用我们，我们不承担任何法律责任。
      我们尊重并保护所有使用用户的个人隐私权，您注册的用户名、电子邮件地址等个人资料，非经您亲自许可或根据相关法律、法规的强制性规定，我们不会主动地泄露给第三方。
      任何单位或个人认为通过我们提供的内容可能涉嫌侵犯其信息网络传播权，应该及时向我们提出书面权利通知，并提供身份证明、权属证明及详细侵权情况证明。我们在收到上述法律文件后，将会依法尽快断开相关链接内容。
      我们一切我们仅为学习交流娱乐所用，请在下载后24小时内删除，未经版权许可，任何单位或个人不得将本站内容或服务用于商业目的。
    </h3>
  </div>
</template>

<script>
export default {};
</script>

<style scoped>
.about_us {
  display: flex;
  justify-content: center;
  align-items: center;
  flex-wrap: wrap;
  flex-direction: column;
  font-size: 16px;
  font-weight: 900;
  padding: 15% 10%;
}
</style>
